HeathenUK/esp_slip_router/tdongle-s3-idf/sdkconfig.defaults
# T-Dongle S3 -- sdkconfig defaults.
#
# Target: ESP32-S3, 16 MB QIO flash (Winbond W25Q128JV), no PSRAM.
# This file gives ESP-IDF native what we couldn't get from the prebuilt
# arduino-esp32 libs: specifically AUTO_SUSPEND on the flash chip, which
# is what makes the device tolerable to strict USB hosts (CH375 / CHUSB).

CONFIG_IDF_TARGET="esp32s3"

# Flash settings -- match the bootloader/flash format pioarduino was using.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Custom partition table (see partitions.csv -- 16 MB layout with OTA
# slots + 8 MB ffat for the USB MSC dev-disk).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ===== The reason this project exists =====
# AUTO_SUSPEND lets a non-IRAM ISR (the OTG IRQ) keep running through a
# flash erase. Without this, the cache disables for ~70 ms per erase
# and the USB device goes silent, which strict hosts treat as a
# disconnect. Winbond W25Q is on Espressif's qualified list for this.
CONFIG_SPI_FLASH_AUTO_SUSPEND=y

# No PSRAM on this dongle variant -- we verified via esptool chip_id.
# CONFIG_SPIRAM is not set

# FreeRTOS: dual-core scheduling stays on (the default).
CONFIG_FREERTOS_HZ=1000

# Console: USB-Serial-JTAG and USB-OTG share GPIO 19/20 on ESP32-S3.
# We keep JTAG enabled so boot logs flow during early init; the moment
# tinyusb_driver_install() flips the USB phy to OTG, JTAG goes away
# and tusb_console_init() takes over via the CDC interface. Any panic
# in usb_start() before the phy flip is still visible over JTAG.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# HTTP server (we use it for /fs, /list, /status, /disk-log, /usb-log,
# /lba, /ota, /reset, etc.)
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=256

# OTA -- we use esp_ota_* for in-app updates via POST /ota.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=n

# WiFi -- station-only, station-host-side WiFi for our IP path.
# STATIC_RX_BUFFER_NUM=16 lets RX_BA_WIN go up to 32 (IDF enforces
# RX_BA_WIN <= 2*STATIC_RX_BUFFER_NUM). Matches Espressif's "Iperf rank"
# defaults.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_LWIP_TCPIP_CORE_LOCKING=y

# IPv4 forwarding + NAPT for the SLIP gateway role (Phase 3). NAPT is
# enabled on the INTERNAL netif (the SLIP side) at runtime -- the IDF
# API is inverted from typical NAT (see memory esp-idf-napt-api-inverted).
CONFIG_LWIP_IP_FORWARD=y
CONFIG_LWIP_IPV4_NAPT=y
# (IP_NAPT_TIMEOUT_MS_UDP is bumped from 2000 -> 30000 via build-time -D
# in CMakeLists.txt -- lwIP doesn't expose it as Kconfig.)
#
# PBUF_POOL_SIZE isn't a Kconfig in IDF -- overridden via build-time -D
# in CMakeLists.txt to 32 (vs default 16).
#
# lwIP TCPIP enqueue mailbox. If burst RX overruns this, tcpip_thread
# misses packets the same as a pbuf fail. Bigger = more headroom.
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64

# TinyUSB / esp_tinyusb -- composite MSC + HID(1) + CDC(1). The
# descriptor itself is hand-rolled in usb.c since esp_tinyusb's stock
# template doesn't include HID.
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=4096
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
# CDC FIFOs sized to hold a whole SLIP MTU (1500) + escape overhead.
# Larger means fewer "FIFO full, wait + flush" stalls inside slip_output
# / slip_feed when DOS pushes a burst.
CONFIG_TINYUSB_CDC_RX_BUFSIZE=2048
# TX FIFO at 4096: lets the consumer task push 2 KB at a time without
# splitting (matched to its drain chunk below) and still leaves a full
# 2 KB of headroom in the ring while a USB IN transfer is in flight.
# Costs 2 KB of BSS over the prior 2048 setting.
CONFIG_TINYUSB_CDC_TX_BUFSIZE=4096
CONFIG_TINYUSB_HID_COUNT=1

# Pin TinyUSB to CPU1. WiFi/lwIP/HTTPD/main all live on CPU0 by IDF
# default; pinning TinyUSB to the other core means it doesn't compete
# with them for cycles, so a burst of WiFi RX or lwIP work can't
# preempt the SCSI CBW processing past CHUSB's tolerance.
#
# Priority 18 (= IDF's lwIP priority; FreeRTOS higher number == higher
# pri) is mostly belt-and-braces since CPU1 has almost nothing else
# running -- the pinning is the real fix. We're below WiFi's 23 by
# design; never starve the radio.
CONFIG_TINYUSB_TASK_AFFINITY_CPU1=y
CONFIG_TINYUSB_TASK_PRIORITY=18

# FATFS -- need f_setlabel() so disk.c can write "DOSONGLE" into the
# volume on first boot. Off by default to save space.
CONFIG_FATFS_USE_LABEL=y

# FATFS sector size must match our hand-built BPB (BytsPerSec=512).
# The default 4096 corresponds to WL's native sector, which would
# require the BPB to match -- but DOS / CHUSB expect 512-byte
# logical sectors, and macOS rejected our earlier 4096-byte BPB.
# Custom diskio in fat.c wraps wl with 512-byte semantics (RMW on
# writes).
CONFIG_FATFS_SECTOR_512=y
# CONFIG_FATFS_SECTOR_4096 is not set

# Use Espressif's VID, custom PID. The product strings are also custom
# (set in usb.c), so we tell esp_tinyusb not to pull in its defaults
# for them either.
CONFIG_TINYUSB_DESC_USE_ESPRESSIF_VID=y
CONFIG_TINYUSB_DESC_USE_DEFAULT_PID=n
CONFIG_TINYUSB_DESC_CUSTOM_PID=0x4023

# Compiler / runtime tuning
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_STACK_CHECK_MODE_NORM=y

# WiFi/lwIP performance tuning. Compatible with OTA after switching
# esp_ota_begin to OTA_WITH_SEQUENTIAL_WRITES (per Espressif's own
# esp_https_ota default; defers erase to per-sector lazy inside
# esp_ota_write, so no 15 s upfront block to fight with the TCP
# window). All four wins are real and reliable together.
# TCP RX window. Throughput here is window/RTT-bound (proven 2026-06-03
# by on-dongle counters: cdc_write blocks ~0%, so the consumer is NOT
# the limit; the dongle just relays what TCP delivers). The window is
# the lever -- but the held backlog is TCP_WND of lwIP pbufs, so it
# trades directly against heap, and over-sizing it STARVES the device
# (which kills BOTH OTA paths -- see the never-starve directive).
#
# History: was 4 KB during the heap crunch (baseline free ~14 KB then;
# an 8 KB window once took min_free to 220 B). The 2026-06-02 SRAM
# trims (fat shared buffer, modem scratch, stream buffer 8192->4096,
# disk-log ring) raised baseline free to ~25 KB, which re-opened room.
#
# 8 KB, validated 2026-06-03 at 240 MHz with a battery (3x sequential
# 1 MB + a concurrent HTTP-/status-hammer worst case):
#   ~100-107 KB/s, all md5 OK, min_free 11.7 K normal / 7.5 K under the
#   concurrent stress, httpd 0 failures, boot heap unaffected (OTA-safe).
# 12 KB went over the cliff: min_free ~800 B, erratic 15-40 KB/s, and
# DATA CORRUPTION (pbuf exhaustion dropped bytes). So 8 KB is the
# validated sweet spot; do not raise without re-running the battery
# and watching min_free. */
CONFIG_LWIP_TCP_WND_DEFAULT=8192
# Send buffer (per-pcb queue lwIP will accept from the app before
# blocking send()). Default IDF v5.5 is 5760 (4*MSS) which caps the
# upload BDP at ~5.6 KB in-flight -- enough for 56 Kbps but throttles
# anything faster. 65535 lets the dongle pipeline a full window of
# upload data before lwIP back-pressures the modem_tcp_pump_task.
# SND_QUEUELEN scales from SND_BUF/MSS so the pbuf-count ceiling
# moves with it (no separate Kconfig needed).
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32
CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_LWIP_EXTRA_IRAM_OPTIMIZATION=y
# CPU at full 240 MHz (was IDF-default 160). Zero SRAM cost -- it's a
# clock. Validated 2026-06-03: Hayes download ~80 -> ~105 KB/s AND made
# it consistent (160 MHz CPU was itself causing the 47-105 jitter), and
# it's SAFER under load (faster CPU drains the pbuf backlog quicker:
# concurrent min_free 5.1 K -> 7.5 K). USB-powered, so power draw is moot.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
# 802.11n Block-ACK receive window. Default 6 is conservative; 32 is
# Espressif's "Iperf rank" recommendation (requires
# STATIC_RX_BUFFER_NUM>=16, satisfied above).
CONFIG_ESP_WIFI_RX_BA_WIN=32
# Pin lwIP TCP/IP task to CPU0 alongside the WiFi driver task, so TCP
# segment processing doesn't bounce between cores. Without this, lwIP
# runs on whichever core happens to be free, often forcing
# cross-core IPC against the WiFi RX task.
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y
# CONFIG_LWIP_TCPIP_TASK_AFFINITY_NO_AFFINITY is not set
# (CDC TX FIFO stays at 2048 -- bumping to 16384 made best case worse,
# the FIFO isn't where the throughput is being lost.)
